:PROPERTIES:
:ID:       259B201B-8C3F-4EA9-9BFB-1A2A7A6E728B
:END:
#+title: Mastering Golang Debugging in Emacs
#+filetags: :debug:emacs:golang:
#+author: Victor Dorneanu
#+date: 2024-11-28
#+setupfile: setup.org
#+draft: false
#+property: header-args :mkdirp yes
#+macro: imglocal http://127.0.0.1:8888/public/img/$1
#+macro: repolink @@html:<a href="https://github.com/dorneanu/blog/tree/master/static/code/2024/emacs-golang-debugging/$1">$1</a>@@

** go.mod
:properties:
:header-args:go: :export both
:end:
Create Go module:

#+begin_src shell :dir (org-sbe code-dir (filename \"\"))
go mod init taskapi
go mod tidy
#+end_src

#+RESULTS:
#+caption: Results
#+begin_src shell
go: creating new go.mod: module taskapi
go: to add module requirements and sums:
	go mod tidy
go: finding module for package github.com/onsi/gomega
go: finding module for package github.com/onsi/ginkgo/v2
go: found github.com/onsi/ginkgo/v2 in github.com/onsi/ginkgo/v2 v2.21.0
go: found github.com/onsi/gomega in github.com/onsi/gomega v1.35.1
#+end_src

Check dependencies:
#+begin_src shell :dir (org-sbe code-dir (filename \"\"))
cat go.mod
#+end_src

#+caption: {{{repolink(go.mod)}}}
#+begin_src go
module taskapi

go 1.23.0

require (
    github.com/onsi/ginkgo/v2 v2.21.0
    github.com/onsi/gomega v1.35.1
)

require (
    github.com/go-logr/logr v1.4.2 // indirect
    github.com/go-task/slim-sprig/v3 v3.0.0 // indirect
    github.com/google/go-cmp v0.6.0 // indirect
    github.com/google/pprof v0.0.0-20241029153458-d1b30febd7db // indirect
    golang.org/x/net v0.30.0 // indirect
    golang.org/x/sys v0.26.0 // indirect
    golang.org/x/text v0.19.0 // indirect
    golang.org/x/tools v0.26.0 // indirect
    gopkg.in/yaml.v3 v3.0.1 // indirect
)
#+end_src

** Profile 3: Attach to a running process
 
In this scenario the application is /already/ running but you want to /attach/ the debugger to it and use Emacs to connect to the debugger session. First we launch the application:

#+caption: Start the taskapi application
#+begin_src shell
$ ./taskapi
2024/11/20 06:34:29 Starting server on :8080
#+end_src

Find out its process ID (PID):
#+begin_src shell :results code 
ps -A | grep -m1 taskapi | awk '{print $1}'
#+end_src

#+RESULTS:
#+caption: Find out PID of running process
#+begin_src shell
56491
#+end_src

Now let's add a 3rd debug profile:

#+name: debug-profile3
#+caption: {{{repolink(.dir-locals.el)}}}: Attach to running process (by pid)
#+begin_src emacs-lisp :tangle no
    ;; Profile 3: Attach to running process (by PID)
    (go-attach-pid
     modes (go-mode go-ts-mode)
     command "dlv"
     command-args ("dap" "--listen" "127.0.0.1:55878" "--log")
     command-cwd default-directory
     host "127.0.0.1"   
     port 55878
     :request "attach"  
     :mode "local"      ;; Attach to a running process local to the server     
     :type "go"
     :processId (+get-process-id-by-name "taskapi")
     :showLog "true")
#+end_src

#+name: get-process-id-by-name
#+caption: {{{repolink(.dir-locals.el)}}}: Helper function
#+begin_src emacs-lisp :tangle no
     ;; Add helpful function 
     (eval . (progn
               (defun +get-process-id-by-name (process-name)
                 "Return the process ID of a process specified by PROCESS-NAME. Works on Unix-like systems (Linux, MacOS)."
                 (interactive)
                 (let ((pid nil))
                   (cond
                    ((memq system-type '(gnu/linux darwin))
                     (setq pid (shell-command-to-string 
                                (format "pgrep -f %s" 
                                        (shell-quote-argument process-name)))))
                    (t
                     (error "Unsupported system type: %s" system-type)))

                   ;; Clean up the output and return first PID
                   (when (and pid (not (string-empty-p pid)))
                     (car (split-string pid "\n" t)))))))
#+end_src

I've also added ~+get-process-id-by-name~ which will return the process ID for the ~taskapi~ application. 
Now you can use the same debug profile (~go-attach-taskapi~) to start a new DAP server and let it attach to a running processs.

#+html: {{< gbox src="/posts/img/2024/emacs-golang-debugging/emacs-attach-running-process-breakpoint.png" title="Set breakpoint to CreateTask" caption="" pos="left" >}}

Now I start the debugger:

#+html: {{< gbox src="/posts/img/2024/emacs-golang-debugging/emacs-attach-running-process-pid.png" title="Specify PID" caption="" pos="left" >}}

If I now send a POST request like this one:

#+begin_src shell
curl -X POST -s http://localhost:8080/task/create \
-H "Content-Type: application/json" \
-d '{"title":"Learn Debugging","description":"Master Emacs debugging with dape","done":false}'
#+end_src

The debugger should automatically halt at the set breakpoint:

#+html: {{< gbox src="/posts/img/2024/emacs-golang-debugging/emacs-attach-running-process-debugging.png" title="Running debugger" caption="" pos="left" >}}

